{
    "main": {
        "title": "SlimeTora",
        "connectedTrackers": "Connected trackers:",
        "startConnection": "Start connection",
        "stopConnection": "Stop connection",
        "onboarding": "Open onboarding",
        "status": {
            "statusText": "Status:",
            "none": "N/A",
            "failed": "error",
            "searching": "searching",
            "connected": "connected",
            "comPortsMissing": "COM ports missing",
            "noConnectionMode": "no connection mode enabled",
            "noTrackerModel": "no tracker model selected",
            "noComPorts": "no COM ports selected",
            "autodetect": {
                "running": "running auto-detection...",
                "success": "auto-detection complete",
                "failed": "auto-detection failed"
            }
        },
        "windowTitle": {
            "main": "SlimeTora: Main",
            "onboarding": "SlimeTora: Onboarding",
            "settings": "SlimeTora: {trackerName} settings",
            "pairing": "SlimeTora: Pairing"
        }
    },
    "trackerInfo": {
        "title": "Tracker information",
        "tooltip": "See information about the connected trackers. An option with yellow text requires a restart of the connection or program to apply.",
        "compactView": "Compact view",
        "censorSerialNumbers": "Censor serial numbers",
        "trackerVisualization": "Tracker visualization",
        "turnOffTrackers": "Turn off all trackers",
        "pairing": "Manage GX(6/2) pairing",
        "deviceName": "Device:",
        "deviceID": "Device ID:",
        "rotationData": "Rotation data:",
        "accelerationData": "Acceleration data:",
        "battery": "Battery:",
        "magStatus": "Mag status:",
        "edit": "Edit",
        "settings": "Override settings",
        "trackerSettings": {
            "title": "{trackerName} settings",
            "text": "Override the global tracker settings for this tracker. Can be useful if only certain trackers have bad mag statuses.",
            "fps": {
                "title": "FPS transfer rate",
                "tooltip": "Select the FPS transfer rate for the trackers. If using Bluetooth, 50FPS may be more stable.",
                "50": "50 FPS",
                "100": "100 FPS"
            },
            "sensorMode": {
                "title": "Sensor mode",
                "tooltip": "Select the sensor mode for the trackers. Mode 1 enables the magnetometer which is best if you have a stable geomagnetic environment (mag status is green or yellow). If unstable (mag status is red), use mode 2.",
                "1": "Mode 1",
                "2": "Mode 2"
            },
            "sensorCorrection": {
                "title": "Sensor auto correction",
                "tooltip": "Enable or disable sensor auto correction (dynamic calibration) features. Usually not needed to be changed and results vary between environments.",
                "accelerometer": "Accelerometer",
                "gyroscope": "Gyroscope",
                "magnetometer": "Magnetometer"
            },
            "debugging": {
                "title": "Debugging",
                "tooltip": "Some debugging options for this individual tracker.",
                "turnOff": "Turn off tracker",
                "resetSettings": "Reset settings",
                "getSettings": "Get tracker settings"
            }
        }
    },
    "programSettings": {
        "title": "Program settings",
        "tooltip": "Set the settings of the program. An option with yellow text requires a restart of the connection or program to apply.",
        "trackerModel": {
            "title": "Tracker model",
            "tooltip": "Select the model of HaritoraX trackers you have, the HaritoraX Wireless or HaritoraX Wired (1.1b/1.1/1.0).",
            "wireless": "HaritoraX Wireless",
            "wired": "HaritoraX 1.1b/1.1/1.0"
        },
        "connectionMode": {
            "title": "Connection mode",
            "tooltip": "Select the connection mode used to connect to the trackers. Multiple modes can be used at the same time if wanted.",
            "bluetooth": "Bluetooth (LE)",
            "com": "COM / GX(6/2)"
        },
        "comPorts": {
            "title": "COM ports",
            "tooltip": "Select the COM ports your GX(6/2) dongles or HaritoraX 1.1b/1.1/1.0 trackers are using. Up to 4 ports can be selected (3 for GX6 and 1 for GX2) unless checks are bypassed."
        },
        "other": {
            "title": "Other settings",
            "tooltip": "Some settings for the program that don't fit in the other categories.",
            "trackerVisualizationFPS": "Tracker visualization FPS",
            "heartbeat": "Tracker heartbeat interval"
        },
        "updates": {
            "title": "Update checking",
            "tooltip": "Modify the settings used when checking for updates on program startup.",
            "app": "App updates",
            "translations": "Translation updates",
            "channel": {
                "title": "Update channel",
                "stable": "Stable",
                "beta": "Beta"
            }
        }
    },
    "trackerSettings": {
        "title": "Tracker settings",
        "tooltip": "Set the global settings for the trackers (can be overriden per-tracker).",
        "fps": {
            "title": "FPS transfer rate",
            "tooltip": "Select the FPS transfer rate for the trackers. If using Bluetooth, 50FPS may be more stable.",
            "50": "50 FPS",
            "100": "100 FPS"
        },
        "sensorMode": {
            "title": "Sensor mode",
            "tooltip": "Select the sensor mode for the trackers. Mode 1 enables the magnetometer which is best if you have a stable geomagnetic environment (mag status is green or yellow). If unstable (mag status is red), use mode 2.",
            "1": "Mode 1",
            "2": "Mode 2"
        },
        "sensorCorrection": {
            "title": "Sensor auto correction",
            "tooltip": "Enable or disable sensor auto correction features (dynamic calibration). Usually not needed to be changed and results vary between environments.",
            "accelerometer": "Accelerometer",
            "gyroscope": "Gyroscope",
            "magnetometer": "Magnetometer"
        }
    },
    "about": {
        "title": "About",
        "text": "The SlimeTora project is a middleware program that allows you to connect the HaritoraX trackers to the SlimeVR server.",
        "authors": "Made by:",
        "credits": {
            "title": "Credits"
        },
        "translations": {
            "title": "Translations"
        }
    },
    "debugging": {
        "title": "Debugging",
        "tooltip": "An option with yellow text requires a restart of the connection or program to apply.",
        "text": "Enable or disable debugging features for the program. Using logging mode 'All data (!!!)' will cause huge log files and lag, only use if asked or have tracker issues!",
        "writeToFile": "Write to log files",
        "bypassPortLimit": "Bypass port limit",
        "loggingMode": {
            "title": "Logging mode",
            "minimal": "Minimal data",
            "extra": "Extra data",
            "all": "All data (!!!)"
        },
        "openLogsFolder": "Open logs folder",
        "openSupportPage": "Open support page"
    },
    "onboarding": {
        "title": "Welcome to SlimeTora!",
        "text": "SlimeTora is a middleware program that allows you to connect your HaritoraX trackers to the SlimeVR server, bypassing HaritoraConfigurator!<br /><br />To get started, select how you would like to set up the program. After you set up the program, you will be guided on how to set up SlimeVR server.",
        "next": "Next",
        "back": "Back",
        "finish": "Finish",
        "manual": "Manual setup (skip)",
        "steps": {
            "step-2": {
                "title": "Automatic setup",
                "text": "Automatic setup allows you to let the program try to automatically detect your settings and set itself up for you. It is the easiest way to get started and supports all tracker models and connection modes.<br /><br />It is recommended (but not necessary) to have at least one of your trackers turned on before continuing. When you are ready, click the \"Next\" button."
            },
            "step-3": {
                "title": "Auto-detection",
                "text": "Press the button below to start the auto-detection process. The process may take up to 20 seconds to complete, <strong>make sure HaritoraConfigurator is closed</strong>.<br />After the process is complete, you will receive a pop-up with the results - make sure they are accurate. If the process fails, you can try again or set up SlimeTora manually.",
                "autodetect": "Start auto-detection",
                "text2": "If you are happy with the results, click the \"Next\" button to continue. Otherwise, you may set up SlimeTora manually."
            },
            "step-4": {
                "title": "SlimeVR setup",
                "text": "Now we're sure you know what SlimeVR is, right? It's the reason why you downloaded SlimeTora in the first place - it's a software that allows for communication between multiple sensors/trackers to use in SteamVR, like HaritoraConfigurator.",
                "download": "Download SlimeVR Server",
                "text2": "To use SlimeTora, you need to have SlimeVR server installed on your computer. If you don't have it installed yet, click the button above to download and install it. After, press the \"Next\" button to learn how to set it up for SlimeTora."
            },
            "step-5": {
                "title": "SlimeVR connection",
                "text": "At this point, you will now want to connect your VR headset to your PC - it's time to put on your trackers! Make sure your trackers (and VR headset) are connected and press the \"Start connection\" button to connect them to the SlimeVR Server.",
                "text2": "When you see all your trackers connected above, check SlimeVR Server and accept all \"A new tracker was found\" pop-ups. Click the \"Next\" button to continue to the next step."
            },
            "step-6": {
                "title": "Tracker assignment",
                "text": "With your trackers connected, you can go through the initial setup of SlimeVR Server. Click \"Let's get set up!\", then \"Skip Wi-Fi settings\", and then \"I put stickers and straps!\". Next, assign your trackers to the correct body part - an example is shown in the screenshot below."
            },
            "step-7": {
                "title": "Mounting calibration",
                "text": "After assigning the trackers, you will be brought to the mounting calibration screen. Select \"Automatic Mounting\" <strong>(highly recommended)</strong> and follow the on-screen instructions on how to do a mounting calibration. If it does not look right after the calibration, you can always redo it until it's accurate or mess with \"Manual Mounting\"."
            },
            "step-8": {
                "title": "Resets & calibration",
                "text": "You will now see a small tutorial on how to perform \"resets\" in SlimeVR. With SlimeTora (along with SlimeVR's built-in tap-to-reset), you may press any of the buttons a number of times (within 0.5s) on your trackers. See the list for the reset options:",
                "list": {
                    "1": "1 press - yaw reset",
                    "2": "2 presses - full reset",
                    "3": "3 presses - mounting reset",
                    "4": "4 presses - pause/unpause tracking"
                }
            },
            "step-9": {
                "title": "When to reset",
                "text": "Here are the explanations of the three different resets and when they would be used:",
                "text2": "A <strong>yaw</strong> reset is the <strong>one you will use the most</strong>, it eliminates most (if not all) drift on one axis. This is less accurate but the fastest and most convenient. You only need to straighten your limbs - this can even be used while laying or sitting down!",
                "text3": "A <strong>full</strong> reset is the most accurate and completely resets the skeleton in SlimeVR. You must be standing up and straight while doing this reset.",
                "text4": "A <strong>mounting</strong> reset is used when the position of your trackers have physically moved (or mounting calibration is off). You must be in a \"ski pose\" while doing this reset.",
                "caption1": "Full reset pose",
                "caption2": "Mounting reset pose"
            },
            "step-10": {
                "title": "Body proportions",
                "text": "Now it's time to calculate your body proportions. SlimeVR applies your body proportions to a virtual skeleton to have much more accurate tracking if set up correctly. Select \"Automatic proportions\" and follow the on-screen instructions to perform the calibration by following a set of movements."
            }
        }
    },
    "pairing": {
        "title": "GX(6/2) Tracker Pairing",
        "text": "Manage the pairing of your trackers connected via the GX(6/2) communication dongles.<br />To pair, press \"Pair/Unpair\" then hold down the (left/smaller) sub button on the tracker you want to pair for 3 seconds. Changing channels requires re-pairing the trackers.",
        "card": {
            "title": "COM port:",
            "id": {
                "title": {
                    "0": "Port ID 0",
                    "1": "Port ID 1"
                },
                "status": {
                    "title": "Status:",
                    "paired": "Paired",
                    "unpaired": "Unpaired",
                    "pairing": "Pairing"
                },
                "tracker": {
                    "title": "Tracker:",
                    "none": "N/A"
                },
                "manage": "Pair/Unpair"
            },
            "manage": "Unpair all"
        }
    },
    "dialogs": {
        "connectionFailed": {
            "title": "Connection failed",
            "message": "Failed to start a connection via the selected connection mode(s). Please make sure HaritoraConfigurator is closed and (if applicable), Bluetooth is on and/or the correct COM ports are selected."
        },
        "slimevrNotFound": {
            "title": "SlimeVR not found",
            "message": "SlimeVR server does not seem to be running, make sure it is running and restart the connection. If it is already running & your trackers are connected, this is safe to ignore."
        },
        "comPortsMissing": {
            "title": "COM ports missing",
            "message": "Some COM ports set in the config were not found, please make sure your dongle(s) and trackers are connected."
        },
        "noLogsFolder": {
            "title": "No logs!",
            "message": "You should probably enable debug logging first in debugging settings."
        },
        "noConnectionMode": {
            "title": "No connection mode enabled",
            "message": "Please enable at least one connection mode in the program's settings."
        },
        "noTrackerModel": {
            "title": "No tracker model selected",
            "message": "Please select a device model in the program's settings."
        },
        "noComPorts": {
            "title": "No COM ports selected",
            "message": "Please select at least one COM port in the program's settings."
        },
        "trackerWriteError": {
            "title": "Tracker write error",
            "message": "Failed to write data to the tracker, please check log files for more information."
        },
        "trackerReadError": {
            "title": "Tracker read error",
            "message": "Failed to read data from the tracker, please check log files for more information."
        },
        "unexpectedError": {
            "title": "Unexpected error",
            "message": "An unexpected error occurred, please check log files for more information."
        },
        "onboarding": {
            "complete": {
                "title": "Onboarding complete!",
                "message": "SlimeTora has been successfully set up! You can always reopen the onboarding screen in the program settings. After this dialog, the program will open the wiki page for you to read more information.\r\n\r\nEnjoy!"
            }
        },
        "autodetect": {
            "pre-check": {
                "title": "Auto-detect pre-check",
                "message": "This feature will attempt to automatically detect your trackers, connection mode, and tracker settings to apply the settings in the program for you.\r\n\r\nMake sure HaritoraConfigurator is closed before proceeding. It is also recommended to turn on at least one of your trackers to find its settings."
            },
            "success": {
                "title": "Auto-detect completed!",
                "message": "Auto-detect completed successfully. Remember this may not be accurate, so please review the settings that have been applied below: {settings}"
            },
            "failed": {
                "title": "Auto-detect failed!",
                "message": "Auto-detect failed. Please make sure you have your Bluetooth/GX(6/2) dongles plugged in & turned on."
            }
        },
        "updates": {
            "app": {
                "available": {
                    "title": "Update available",
                    "message": "A new {versionType} version ({latestVersion}) of SlimeTora is available.",
                    "detail": "Please visit the GitHub releases page to download the latest version.",
                    "buttons": {
                        "yes": "Download",
                        "no": "Cancel"
                    },
                    "versionType": {
                        "beta": "beta",
                        "stable": "stable"
                    }
                }
            },
            "translations": {
                "available": {
                    "title": "Update available",
                    "message": "New translation updates available: {files}.",
                    "detail": "Would you like to download them?",
                    "buttons":{
                        "yes": "Download",
                        "no": "Cancel"
                    }
                },
                "downloaded": {
                    "title": "Updates downloaded",
                    "message": "Translation updates have been downloaded ",
                    "detail": "Please restart the application to apply the changes.",
                    "buttons": {
                        "yes": "OK"
                    }
                }
            }
        },
        "maxLoggingWarning": {
            "title": "Logging mode warning",
            "message": "You have selected a logging mode that may cause huge log files and lag. Remember to only use this mode if asked or have tracker issues!"
        }
    }
}
