{
    "main": {
        "title": "SwimeTowa",
        "connectedTrackers": "Connyected kitties:",
        "startConnection": "Stawt meowing",
        "stopConnection": "No meowing :(",
        "onboarding": "Meow at onboawding",
        "status": {
            "statusText": "Nyatus:",
            "none": "N(y)A",
            "failed": "brokie :(",
            "searching": "cyatching red dot...",
            "connected": "on :o",
            "comPortsMissing": "COM powts missing",
            "noConnectionMode": "nyo connyection mode enyabwed",
            "noTrackerModel": "nyo twackew modew sewected",
            "noComPorts": "nyo COM powts sewected",
            "autodetect": {
                "running": "wunnying cat-detection...",
                "success": "cat-detection compwete :3",
                "failed": "cat-detection faiwed :("
            }
        },
        "windowTitle": {
            "main": "SwimeTowa: :3",
            "onboarding": "SwimeTowa: Onboawding",
            "settings": "SwimeTowa: {trackerName} meowings",
            "pairing": "SwimeTowa: Paiwing"
        }
    },
    "trackerInfo": {
        "title": "Twackew infowmation",
        "tooltip": "See infowmation about the connyected twackews. An option with yewwow text wequiwes a westawt of the connyection ow pwogwam to appwy.",
        "compactView": "Smol wiew",
        "censorSerialNumbers": "aaa hide twackew nyumbews",
        "trackerVisualization": "See twackews :o",
        "turnOffTrackers": "Cyutely kill aww twackews :3",
        "pairing": "Manyage GX(6/2) paiwing",
        "deviceName": "Dewice:",
        "deviceID": "Dewice ID:",
        "rotationData": "Wotation data:",
        "accelerationData": "Accewewation data:",
        "battery": "Battewy:",
        "magStatus": "Magnyatus:",
        "edit": "Edit",
        "settings": "Owewwide meowings",
        "trackerSettings": {
            "title": "{trackerName} meowings",
            "text": "Owewwide the gwobaw twackew meowings fow this twackew. Can be usefuw if onwy cewtain twackews hawe bad mag statuses.",
            "fps": {
                "title": "Nyas twansfew wate",
                "tooltip": "Sewect the nyas twansfew wate fow the twackews. If using Bwuetooth, 50FPS may be mowe stabwe.",
                "50": "50 nyas",
                "100": "100 nyas"
            },
            "sensorMode": {
                "title": "Sensow mode",
                "tooltip": "Sewect the sensow mode fow the twackews. Mode 1 enyabwes the magnyetometew which is best if you hawe a stabwe geomagnyetic enwiwonment (magnyatus is gween ow yewwow). If unstabwe (magnyatus is wed), use mode 2.",
                "1": "Mode 1",
                "2": "Mode 2"
            },
            "sensorCorrection": {
                "title": "Sensow auto cowwection",
                "tooltip": "Enyabwe ow disabwe sensow auto cowwection (dynyamic cawibwation) featuwes. Usuawwy nyot nyeeded to be changed and wesuwts wawy between enwiwonments.",
                "accelerometer": "Accewewometew",
                "gyroscope": "Gywoscope",
                "magnetometer": "Magnyetometew"
            },
            "debugging": {
                "title": "Demeowing",
                "tooltip": "Some demeowing options fow this indiwiduaw twackew.",
                "turnOff": "Tuwn off twackew",
                "resetSettings": "Weset meowings",
                "getSettings": "Get twackew meowings"
            }
        }
    },
    "programSettings": {
        "title": "Pwogwam meowings",
        "tooltip": "Set the meowings of the pwogwam. An option with yewwow text wequiwes a westawt of the connyection ow pwogwam to appwy.",
        "trackerModel": {
            "title": "Twackew modew",
            "tooltip": "Sewect the modew of HawitowaX twackews you hawe, the HawitowaX Wiwewess ow HawitowaX Wiwed (1.1b/1.1/1.0).",
            "wireless": "HawitowaX Wiwewess",
            "wired": "HawitowaX 1.1b/1.1/1.0"
        },
        "connectionMode": {
            "title": "Connyection mode",
            "tooltip": "Sewect the connyection mode used to connyect to the twackews. Muwtipwe modes can be used at the same time if wanted.",
            "bluetooth": "Bwuetooth (WE)",
            "com": "COM / GX(6/2)"
        },
        "comPorts": {
            "title": "COM powts",
            "tooltip": "Sewect the COM powts youw GX(6/2) dongwes ow HawitowaX 1.1b/1.1/1.0 twackews awe using. Up to 4 powts can be sewected (3 fow GX6 and 1 fow GX2) unwess checks awe bypassed."
        },
        "other": {
            "title": "Othew meowings",
            "tooltip": "Some meowings fow the pwogwam that don't fit in the othew categowies.",
            "trackerVisualizationFPS": "Twackew wisuawization nyas",
            "heartbeat": "Twackew heawtbeat intewwaw"
        },
        "updates": {
            "title": "Nyadates checking",
            "tooltip": "Modify the meowings used when checking fow nyadates on pwogwam stawtup.",
            "app": "App nyadates",
            "translations": "Twanswation nyadates",
            "channel": {
                "title": "Update channyew",
                "stable": "Stabwe",
                "beta": "Bweta"
            }
        }
    },
    "trackerSettings": {
        "title": "Twackew meowings",
        "tooltip": "Set the gwobaw meowings fow the twackews (can be uvwwiden pew-twackew).",
        "fps": {
            "title": "Nyas twansfew wate",
            "tooltip": "Sewect the nyas twansfew wate fow the twackews. If using Bwuetooth, 50FPS may be mowe stabwe.",
            "50": "50 nyas",
            "100": "100 nyas"
        },
        "sensorMode": {
            "title": "Sensow mode",
            "tooltip": "Sewect the sensow mode fow the twackews. Mode 1 enyabwes the magnyetometew which is best if you hawe a stabwe geomagnyetic enwiwonment (magnyatus is gween ow yewwow). If unstabwe (magnyatus is wed), use mode 2.",
            "1": "Mode 1",
            "2": "Mode 2"
        },
        "sensorCorrection": {
            "title": "Sensow auto cowwection",
            "tooltip": "Enyabwe ow disabwe sensow auto cowwection featuwes (dynyamic cawibwation). Usuawwy nyot nyeeded to be changed and wesuwts wawy between enwiwonments.",
            "accelerometer": "Accewewometew",
            "gyroscope": "Gywoscope",
            "magnetometer": "Magnyetometew"
        }
    },
    "about": {
        "title": "who us :3",
        "text": "The SwimeTowa pwojyect is a middwewawe pwogwam that awwows you to connyect the HawitowaX twackews to the SwimeVW sewwew.",
        "authors": "Meowed by:",
        "credits": {
            "title": "Cwedits"
        },
        "translations": {
            "title": "Twanswations"
        }
    },
    "debugging": {
        "title": "Demeowing",
        "tooltip": "An option with yewwow text wequiwes a westawt of the connyection ow pwogwam to appwy.",
        "text": "Enyabwe ow disabwe demeowing featuwes fow the pwogwam. Using wogging mode 'Aww data (!!!)' wiww cause huge wog fiwes and wag, onwy use if asked ow hawe twackew issues!",
        "writeToFile": "Wwite to wog fiwes",
        "bypassPortLimit": "Bypass powt wimit",
        "loggingMode": {
            "title": "Wogging mode",
            "minimal": "Minyimaw data",
            "extra": "Extwa data",
            "all": "Aww data (!!!)"
        },
        "openLogsFolder": "Meow at wogs fowdew",
        "openSupportPage": "Meow at suppowt page"
    },
    "onboarding": {
        "title": "Wewcome to SwimeTowa! :3",
        "text": "SwimeTowa is a middwewawe pwogwam that awwows you to connyect youw HawitowaX twackews to the SwimeVW sewwew, bypassing the officiaw softwawe!<br /><br />To get stawted, sewect how you wouwd wike to set up the pwogwam. Aftew you set up the pwogwam, you wiww be guided on how to set up SwimeVW sewwew.",
        "next": "Nyext",
        "back": "Back",
        "finish": "Finyish",
        "manual": "Manyuaw setup (skip)",
        "steps": {
            "step-2": {
                "title": "Automatic setup",
                "text": "Automatic setup awwows you to wet the pwogwam twy to automaticawwy detect youw meowings and set itsewf up fow you. It is the easiest way to get stawted and suppowts aww twackew modews and connyection modes.<br /><br />It is wecommended (but nyot nyecessawy) to hawe at weast onye of youw twackews tuwnyed on befowe continyuing. When you awe weady, cwick the \"Nyext\" button."
            },
            "step-3": {
                "title": "Cat-detection",
                "text": "Pwess the button bewow to stawt the cat-detection pwocess. The pwocess may take up to 20 seconds to compwete, <b>make suwe the officiaw softwawe is cwosed</b>.<br />Aftew the pwocess is compwete, you wiww weceiwe a pop-up with the wesuwts - make suwe they awe accuwate. If the pwocess faiws, you can twy again ow set up SwimeTowa manyuawwy.",
                "autodetect": "Stawt cat-detection",
                "text2": "If you awe happy with the wesuwts, cwick the \"Nyext\" button to continyue. Othewwise, you may set up SwimeTowa manyuawwy."
            },
            "step-4": {
                "title": "SwimeVW setup",
                "text": "Nyow we'we suwe you knyow what SwimeVW is, wight? It's the weason why you downwoaded SwimeTowa in the fiwst pwace - it's a softwawe that awwows fow communyication between muwtipwe sensows/twackews to use in SteamVW, wike the officiaw softwawe.",
                "download": "Downwoad SwimeVW Sewwew",
                "text2": "To use SwimeTowa, you nyeed to hawe SwimeVW sewwew instawwed on youw computew. If you don't hawe it instawwed yet, cwick the button abuv to downwoad and instaww it. Aftew, pwess the \"Nyext\" button to weawn how to set it up fow SwimeTowa."
            },
            "step-5": {
                "title": "SwimeVW connyection",
                "text": "At this point, you wiww nyow want to connyect youw VW headset to youw PC - it's time to put on youw twackews! Make suwe youw twackews (and VW headset) awe connyected and pwess the \"Stawt connyection\" button to connyect them to the SwimeVW Sewwew.",
                "text2": "When you see aww youw twackews connyected abuv, check SwimeVW Sewwew and accept aww \"A nyew twackew was found\" pop-ups. Cwick the \"Nyext\" button to continyue to the nyext step."
            },
            "step-6": {
                "title": "Twackew assignment",
                "text": "With youw twackews connyected, you can go thwough the inyitiaw setup of SwimeVW Sewwew. Cwick \"Wet's get set up!\", then \"Skip Wi-Fi meowings\", and then \"I put stickews and stwaps!\". Nyext, assign youw twackews to the cowwect body pawt - an exampwe is shown in the scweenshot bewow."
            },
            "step-7": {
                "title": "Mounting cawibwation",
                "text": "Aftew assignying the twackews, you wiww be bwought to the mounting cawibwation scween. Sewect \"Automatic Mounting\" <b>(highwy wecommended)</b> and fowwow the on-scween instwuctions on how to do a mounting cawibwation. If it does nyot wook wight aftew the cawibwation, you can awways wedo it untiw it's accuwate ow mess with \"Manyuaw Mounting\"."
            },
            "step-8": {
                "title": "Wesets & cawibwation",
                "text": "You wiww nyow see a smaww tutowiaw on how to pewfowm \"wesets\" in SwimeVW. With SwimeTowa (awong with SwimeVW's buiwt-in tap-to-weset), you may pwess any of the buttons a nyumbew of times (within 0.5s) on youw twackews. See the wist fow the weset options:",
                "list": {
                    "1": "1 pwess - yaw weset",
                    "2": "2 pwesses - fuww weset",
                    "3": "3 pwesses - mounting weset",
                    "4": "4 pwesses - pause/unpause twacking"
                }
            },
            "step-9": {
                "title": "When to weset",
                "text": "Hewe awe the expwanyations of the thwee diffewent wesets and when they wouwd be used:",
                "text2": "A <b>yaw</b> weset is the <b>onye you wiww use the most</b>, it ewiminyates most (if nyot aww) dwift on onye axis. This is wess accuwate but the fastest and most conwenyient. You onwy nyeed to stwaighten youw wimbs - this can ewen be used whiwe waying ow sitting down!",
                "text3": "A <b>fuww</b> weset is the most accuwate and compwetewy wesets the skeweton in SwimeVW. You must be standing up and stwaight whiwe doing this weset.",
                "text4": "A <b>mounting</b> weset is used when the position of youw twackews hawe physicawwy muvd (ow mounting cawibwation is off). You must be in a \"ski pose\" whiwe doing this weset.",
                "caption1": "Fuww weset pose",
                "caption2": "Mounting weset pose"
            },
            "step-10": {
                "title": "Body pwopowtions",
                "text": "SwimeVW appwies youw body pwopowtions on a wiwtuaw skeweton fow accuwate twacking. Sewect \"Automatic pwopowtions\" and fowwow the on-scween instwuctions cawibwate by fowwowing a set of muvments. <b>You onwy nyeed to do this once and is awso optionyaw!</b>\r\n\r\nIf you hawe issues, you can awways wetwy ow use the defauwts (\"Weset aww pwopowtions\")."
            },
            "step-11": {
                "title": "Wewaunching SwimeVW",
                "text": "When wewaunching SwimeVW, pewfowm a \"Fuww Weset\" and then a \"Mounting Weset\" befowe cawibwating in-game. <strong>Again, you do nyot hawe to pewfowm the pwopowtions cawibwation again - it is onwy donye once!</strong> Make suwe to wefew to the SwimeTowa wiki ow watch wideos on how to get the best fwom SwimeVW - ZWock35 is a gweat pewson to watch!",
                "watch": "Watch cawibwation wideo"
            }
        }
    },
    "pairing": {
        "title": "GX(6/2) Twackew Paiwing",
        "text": "Manyage the paiwing of youw twackews connyected wia the GX(6/2) communyication dongwes.<br /><br />To paiw, pwess \"Paiw/Unpaiw\" then howd down the (weft/smawwew) sub button on the twackew you want to paiw fow 3 seconds. Changing channyews wequiwes we-paiwing the twackews.<br /><br />Tweat this as a bweta - if you hawe issues, use the officiaw softwawe.",
        "card": {
            "title": "COM powt:",
            "id": {
                "title": {
                    "0": "Powt ID 0",
                    "1": "Powt ID 1"
                },
                "status": {
                    "title": "Nyatus:",
                    "paired": "Paiwed",
                    "unpaired": "Unpaiwed",
                    "pairing": "Paiwing"
                },
                "tracker": {
                    "title": "Twackew:",
                    "none": ":("
                },
                "manage": "Paiw/Unpaiw"
            },
            "manage": "Unpaiw aww"
        }
    },
    "dialogs": {
        "connectionFailed": {
            "title": "Connyection faiwed",
            "message": "Faiwed to stawt a connyection wia the sewected connyection mode(s). Pwease make suwe the officiaw softwawe is cwosed and (if appwicabwe), Bwuetooth is on and/ow the cowwect COM powts awe sewected."
        },
        "slimevrNotFound": {
            "title": "SwimeVW nyot found",
            "message": "SwimeVW sewwew does nyot seem to be wunnying, make suwe it is wunnying and westawt the connyection. If it is awweady wunnying & youw twackews awe connyected, this is safe to ignyowe."
        },
        "comPortsMissing": {
            "title": "COM powts missing",
            "message": "Some COM powts set in the config wewe nyot found, pwease make suwe youw dongwe(s) and twackews awe connyected."
        },
        "noLogsFolder": {
            "title": "Nyo wogs!",
            "message": "You shouwd pwobabwy enyabwe debug wogging fiwst in demeowing meowings."
        },
        "noConnectionMode": {
            "title": "Nyo connyection mode enyabwed",
            "message": "Pwease enyabwe at weast onye connyection mode in the pwogwam's meowings."
        },
        "noTrackerModel": {
            "title": "Nyo twackew modew sewected",
            "message": "Pwease sewect a dewice modew in the pwogwam's meowings."
        },
        "noComPorts": {
            "title": "Nyo COM powts sewected",
            "message": "Pwease sewect at weast onye COM powt in the pwogwam's meowings."
        },
        "trackerWriteError": {
            "title": "Twackew wwite ewwow",
            "message": "Faiwed to wwite data to the twackew, pwease check wog fiwes fow mowe infowmation."
        },
        "trackerReadError": {
            "title": "Twackew wead ewwow",
            "message": "Faiwed to wead data fwom the twackew, pwease check wog fiwes fow mowe infowmation."
        },
        "unexpectedError": {
            "title": "Unyexpected ewwow",
            "message": "An unyexpected ewwow occuwwed, pwease check wog fiwes fow mowe infowmation."
        },
        "onboarding": {
            "unix": {
                "title": "Unyix detected",
                "message": "It seems you awe wunnying SwimeTowa on a Unyix-based system, some extwa setup is wequiwed befowe continyuing.\r\n\r\nThe SwimeTowa wiki wiww open aftew this diawog to guide you thwough the nyecessawy steps."
            },
            "complete": {
                "title": "Onboawding compwete!",
                "message": "SwimeTowa has been successfuwwy set up! You can awways weopen the onboawding scween in the pwogwam meowings. Aftew this diawog, the pwogwam wiww open the wiki page fow you to wead mowe infowmation.\r\n\r\nEnjyoy!"
            }
        },
        "autodetect": {
            "pre-check": {
                "title": "Auto-detect pwe-check",
                "message": "This featuwe wiww attempt to automaticawwy detect youw twackews, connyection mode, and twackew meowings to appwy the meowings in the pwogwam fow you.\r\n\r\nMake suwe the officiaw softwawe is cwosed befowe pwoceeding. It is awso wecommended to tuwn on at weast onye of youw twackews to find its meowings."
            },
            "success": {
                "title": "Auto-detect compweted!",
                "message": "Auto-detect compweted successfuwwy. Wemembew this may nyot be accuwate, so pwease wewiew the meowings that hawe been appwied bewow: {settings}"
            },
            "failed": {
                "title": "Auto-detect faiwed!",
                "message": "Auto-detect faiwed. Pwease make suwe you hawe youw Bwuetooth/GX(6/2) dongwes pwugged in & tuwnyed on."
            }
        },
        "updates": {
            "app": {
                "available": {
                    "title": "Update awaiwabwe",
                    "message": "A nyew {versionType} wewsion ({latestVersion}) of SwimeTowa is awaiwabwe.",
                    "detail": "Pwease wisit the GitHub weweases page to downwoad the watest wewsion.",
                    "buttons": {
                        "yes": "Downwoad",
                        "no": "Cancew"
                    },
                    "versionType": {
                        "beta": "bweta",
                        "stable": "stabwe"
                    }
                }
            },
            "translations": {
                "available": {
                    "title": "Update awaiwabwe",
                    "message": "Nyew twanswation updates awaiwabwe: {files}.",
                    "detail": "Wouwd you wike to downwoad them?",
                    "buttons": {
                        "yes": "Downwoad",
                        "no": "Cancew"
                    }
                },
                "downloaded": {
                    "title": "Updates downwoaded",
                    "message": "Twanswation updates hawe been downwoaded ",
                    "detail": "Pwease westawt the appwication to appwy the changes.",
                    "buttons": {
                        "yes": "OK"
                    }
                }
            }
        },
        "maxLoggingWarning": {
            "title": "Wogging mode wawnying",
            "message": "You hawe sewected a wogging mode that may cause huge wog fiwes and wag. Wemembew to onwy use this mode if asked ow hawe twackew issues!"
        }
    }
}